<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Installs the latest version of MDS.</string>
	<key>Identifier</key>
	<string>com.github.macprince.install.MDS</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MDS</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.macprince.download.MDS</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%/MDS.pkg</string>
            </dict>
		</dict>
	</array>
</dict>
</plist>
