<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of MDS and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.macprince.munki.MDS</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>MDS</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>MDS.app</string>
				<string>Autoupdate.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Deploy Macs in Minutes
Quickly set up and provision Macs with MDS. Within minutes of a Mac pulled out of the box, it will be set up, configured, and ready to deploy. MDS works with all Macs, including new Macs with Secure Boot and System Integrity Protection. MDS sets up all the resources for booting from the recovery partition or an external drive, wiping and installing macOS, and installing require packages. It is the easiest, fastest way to deploy Macs.</string>
			<key>developer</key>
			<string>Twocanoes Software</string>
			<key>display_name</key>
			<string>MDS</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>category</key>
			<string>Admin Tools</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.macprince.download.MDS</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
