<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of VitalSource Bookshelf.</string>
	<key>Identifier</key>
	<string>com.github.macprince.download.VitalSourceBookshelf</string>
	<key>Input</key>
	<dict>
		<key>FEED_URL</key>
		<string>https://api.vitalsource.com/v3/versions/check</string>
		<key>USER_AGENT</key>
		<string>VitalSource Bookshelf/10.0.0 (Mac OS/Version 10.15.7 (Build 19H1419); en-US) Sparkle/1.0</string>
		<key>NAME</key>
		<string>VitalSource Bookshelf</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>%FEED_URL%</string>
				<key>appcast_request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>%USER_AGENT%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/VitalSource Bookshelf.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.vitalsource.bookshelf" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QX549BPYZU)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/VitalSource Bookshelf.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
