<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Unity 3D build support component installer packages.
COMPONENT can be (currently): 
android
ios
appletv
visionos
linux-il2cpp
linux-mono
linux-server
mac-il2cpp
mac-server
webgl
windows-mono
windows-server
	</string>
	<key>Identifier</key>
	<string>com.github.macprince.download.Unity3DComponent</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Unity3DComponent-%COMPONENT%</string>
		<key>MAJOR_VERSION</key>
		<string>6000</string>
		<key>STREAM</key>
		<string>SUPPORTED</string>
		<key>COMPONENT</key>
		<string>ios</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>major_version</key>
				<string>%MAJOR_VERSION%</string>
				<key>component</key>
				<string>%COMPONENT%</string>
				<key>stream</key>
				<string>%STREAM%</string>
			</dict>
			<key>Processor</key>
			<string>Unity3DComponentURLProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Unity Technologies SF (9QW8UQUTAA)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
