<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.4.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of RealCare Control Center.</string>
	<key>Identifier</key>
	<string>com.github.macprince.download.RealCareControlCenter</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RealCareControlCenter</string>
		<key>UPDATE_BASE_URL</key>
		<string>https://update.realityworks.com</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%UPDATE_BASE_URL%/HostUpdates.php?dev=RCB3&amp;p=M&amp;l=en&amp;hostid=0&amp;subsys[HST]=1.1.1.1</string>
				<key>re_pattern</key>
				<string>HostGet.*\.pkg</string>
				<key>curl_opts</key>
				<array>
					<string>-g</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%UPDATE_BASE_URL%/%match%</string>
				<key>filename</key>
				<string>%NAME%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Realityworks, Inc. (YW3274ML5G)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
