<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Airtame and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.macprince.munki.Airtame</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Airtame</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Airtame.app</string>
				<string>Airtame Helper (GPU).app</string>
				<string>Airtame Helper (Plugin).app</string>
				<string>Airtame Helper (Renderer).app</string>
				<string>Airtame Helper.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>AIRTAME APS</string>
			<key>display_name</key>
			<string>Airtame</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
            <key>preinstall_script</key>
            <string>#!/bin/sh

## This patches over a bug with Airtame's own postinstall script in the .pkg that installs their audio driver.
## They're trying to copy to /Library/Audio/Plug-Ins/HAL which doesn't exist, so the contents of the driver end up there instead.

HAL_DIRECTORY="/Library/Audio/Plug-Ins/HAL"

if [ ! -d "$HAL_DIRECTORY" ]; then
    echo "Audio/Plug-ins/HAL directory does not exist, creating"
    mkdir -p "$HAL_DIRECTORY"
fi

if [ -d "$HAL_DIRECTORY/Contents" ]; then
    echo "Broken previous AirtameAudio.driver install found, cleaning up"
    rm -r "$HAL_DIRECTORY/Contents"
fi</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.macprince.download.Airtame</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
