<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Flutter.</string>
	<key>Identifier</key>
	<string>com.github.macprince.download.Flutter</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Flutter</string>
		<key>ARCH</key>
		<string>arm64</string>
		<key>CHANNEL</key>
		<string>stable</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>arch</key>
				<string>%ARCH%</string>
				<key>channel</key>
				<string>%CHANNEL%</string>
			</dict>
			<key>Processor</key>
			<string>FlutterURLProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
