<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of PLTW Kite Student Portal and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.macprince.munki.PLTWKiteStudentPortal</string>
	<key>Input</key>
	<dict>
		<key>SHORT_NAME</key>
		<string>PLTWKiteStudentPortal</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%SHORT_NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>The PLTW Kite Student Portal allows students to complete the Project Lead the Way (PLTW) Course Assessments.  PLTW assessments are standardized tests given during and at the completion of a PLTW course. The test measures a student’s progress and learning achievement in the course.</string>
			<key>developer</key>
			<string>Project Lead The Way</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%SHORT_NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nstrauss.download.PLTWKiteStudentPortal</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
