<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Safe Exam Browser with config file for the Illinois State Board of Education's science assessment.</string>
	<key>Identifier</key>
	<string>com.github.macprince.download.ISBE-ISA</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ISBE-ISA</string>
		<key>TOP_URL</key>
		<string>https://www.isbe.net</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>ISBE has switched the Illinois Science Assessment to TestNav, this recipe is defunct.</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
	</array>
</dict>
</plist>
