<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Installs the latest version of Merlyn Origin.</string>
	<key>Identifier</key>
	<string>com.github.macprince.install.MerlynOrigin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MerlynOrigin</string>
        <key>APPNAME</key>
        <string>Merlyn Origin</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.macprince.download.MerlynOrigin</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%ARCHITECTURE%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%ARCHITECTURE%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%dmg_path%</string>
				<key>items_to_copy</key>
				<array>
					<dict>
						<key>destination_path</key>
						<string>/Applications</string>
						<key>source_item</key>
						<string>%APPNAME%.app</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>InstallFromDMG</string>
		</dict>
	</array>
</dict>
</plist>
