<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Merlyn Origin and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.macprince.munki.MerlynOrigin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MerlynOrigin</string>
        <key>APPNAME</key>
        <string>Merlyn Origin</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
        <key>MUNKI_ARCHITECTURE</key>
        <string>arm64</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>For the first time in history, computers can speak our language. With the Merlyn AI assistant, you can control classroom technology and access the world’s information with the power of your voice, all with the confidence that it’s private, safe, and secure.</string>
			<key>developer</key>
			<string>Merlyn Mind</string>
			<key>display_name</key>
			<string>%APPNAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>Education</string>
        	<key>supported_architectures</key>
        	<array>
        		<string>%MUNKI_ARCHITECTURE%</string>
        	</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.macprince.download.MerlynOrigin</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%ARCHITECTURE%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%ARCHITECTURE%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
